blogs/how-pagecache-make-cpu-intensive-program-slow.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-09-03 日 22:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>pagecache如何让cpu密集程序变慢</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="zhengzhiyong" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">pagecache如何让cpu密集程序变慢</h1>
<p>
问题的现象：业务的某些实例运行（在k8s中）缓慢（把实例中的程序记作ffm），即使运行 ffm -v（查看版本） 都很慢。
</p>

<div id="outline-container-orga295bea" class="outline-2">
<h2 id="orga295bea"><span class="section-number-2">1</span> 耗时分析</h2>
<div class="outline-text-2" id="text-1">
<p>
既然运行缓慢，先和正常实例，大概对比下运行耗时，这里使用time ffm -v 运行。
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">实例</th>
<th scope="col" class="org-left">耗时</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">正常实例</td>
<td class="org-left">real 0m0.997s</td>
<td class="org-left">(user+sys)/real = 1</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">user 0m0.599s</td>
<td class="org-left">说明cpu使用率100%</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">sys  0m0.383s</td>
<td class="org-left">符合cpu密集的特征</td>
</tr>

<tr>
<td class="org-left">异常实例</td>
<td class="org-left">real 0m53.659s</td>
<td class="org-left">(user+sys)/real &lt; 1</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">user 0m0.480s</td>
<td class="org-left">CPU使用率不足100%</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">sys  0m0.380s</td>
<td class="org-left">说明进程有相当的时间处于S状态</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgc0d2545" class="outline-2">
<h2 id="orgc0d2545"><span class="section-number-2">2</span> 进程S状态</h2>
<div class="outline-text-2" id="text-2">
<p>
进程如果在S状态，通常是在等待，此时可以查看内核态的栈（小知识：进程在S状态，必然处在内核态），查看方法 <code>cat /proc/&lt;pid&gt;/stack</code>
</p>

<pre class="example">
$ cat /proc/$(pgrep -nf ffm)/stack
[&lt;0&gt;] io_schedule+0x12/0x40
[&lt;0&gt;] __lock_page_or_retry+0x1c9/0x4e0
[&lt;0&gt;] filemap_fault+0x199/0x860
[&lt;0&gt;] __xfs_filemap_fault+0x6d/0x200
[&lt;0&gt;] __do_fault_0x20/0x80
[&lt;0&gt;] __handle_mm_fault+0x539/0x6b0
[&lt;0&gt;] handle_mm_fault+0xda/0x200
[&lt;0&gt;] __do_page_fault_0x22b/0x4e0
</pre>

<p>
 <small>备注：此命令需要在k8s的宿主上执行，后面需要宿主执行的会简单标注宿主</small>
</p>

<p>
调用栈透露出关键信息：
</p>
<ol class="org-ol">
<li><code>io_schedule</code> 说明程序因为io进入S状态;</li>
<li><code>filemap_fault</code> 说明io和mmap有关。</li>
</ol>

<p>
背景知识：
</p>
<ol class="org-ol">
<li>可以通过IO相关的系统调用（read、write），主动发起IO操作;</li>
<li>可以通过mmap做文件映射，通过操作内存的方式，隐式发起IO操作，触发的入口是page fault。</li>
</ol>

<p>
下面需要跟踪mmap系统调用，看看mmap和哪些文件有关，跟踪方法 <code>strace -tt -T ffm -v</code>
</p>
<pre class="example">
12:20:59.202402 open("/usr/local/libtorch/libtorch_cpu.so", O_RDONLY|O_CLOEXEC) = 3 &lt;0.000014&gt;
12:20:59.202653 mmap(NULL, 306632192, PROT_READ|PROT_EXEC, MAP_PRIVATE|MAP_DENYWRITE, 3, 0) = 0x7f1294b28000 &lt;0.000017&gt;
</pre>

<p>
mmap 都是so文件，也就是程序执行所需的代码段，数量不少。
</p>

<p>
背景知识：
</p>
<ol class="org-ol">
<li>程序执行需要把代码段加载到内存，是通过mmap实现的，mmap内存的存在形式是page cache;</li>
<li>mmap 对应的 page cache，如果可以、并且需要，内核可以回收。</li>
</ol>

<p>
这里有个疑问：因为有page cache，只有第一次执行 ffm -v 会慢才对？
</p>
</div>
</div>

<div id="outline-container-org8c899a5" class="outline-2">
<h2 id="org8c899a5"><span class="section-number-2">3</span> 和page cache有关吗？</h2>
<div class="outline-text-2" id="text-3">
<p>
因为k8s实例运行在cgroup中，可能和cgroup有关，为此做了一组实验：
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">运行ffm -v的时间线</th>
<th scope="col" class="org-left">执行耗时</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">（cgroup内）第一次执行</td>
<td class="org-left">2m47s</td>
<td class="org-left">符合预期，因为需要warmup page cache，通过biosnoop观察到IO</td>
</tr>

<tr>
<td class="org-left">（cgroup内）第二次执行</td>
<td class="org-left">2m15s</td>
<td class="org-left">不符合预期，page cache似乎不存在，仍观察到IO</td>
</tr>

<tr>
<td class="org-left">（cgroup外）第一次执行</td>
<td class="org-left">1m55s</td>
<td class="org-left">符合预期，因为需要warmup page cache，通过biosnoop观察到IO</td>
</tr>

<tr>
<td class="org-left">（cgroup外）第二次执行</td>
<td class="org-left">1.71s</td>
<td class="org-left">符合预期，page cache存在，没观察到IO</td>
</tr>

<tr>
<td class="org-left">（cgroup内）第三此执行</td>
<td class="org-left">1.89s</td>
<td class="org-left">符合预期，因为page cache基于inode，只要文件相同，无论cgroup内外，可以共享page cache</td>
</tr>

<tr>
<td class="org-left">执行drop caches</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">无论cgroup内外，执行耗时都和第一次一样，说明的确是page cache影响了性能</td>
</tr>
</tbody>
</table>

<p>
 <small> 相关命令 </small>
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">biosnoop &#21629;&#20196;&#65292;&#26469;&#33258;bcc&#65292;&#23487;&#20027;&#25191;&#34892;</span>
biosnoop | grep ffm

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">&#25214;&#21040;ffm&#29992;&#21040;&#30340;so&#65292;strace.txt &#26159;&#19978;&#25991; strace &#30340;&#36755;&#20986;&#65292;cgroup&#20869;&#25191;&#34892;</span>
grep -w open strace.txt | grep -v ENOENT | awk -F <span style="color: #ffa07a;">'"'</span> <span style="color: #ffa07a;">'{print $2}'</span> &gt; f.txt

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">&#25163;&#21160;&#39044;&#28909;&#65292;&#23487;&#20027;&#25191;&#34892;&#65292;$pid&#26159;cgroup 1&#21495;&#36827;&#31243;&#22312;&#23487;&#20027;&#19978;&#23545;&#24212;&#30340;pid</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">&#25163;&#21160;&#39044;&#28909;&#21518;&#65292;cgroup&#20869;&#25191;&#34892;ffm -v&#21487;&#29992;&#20351;&#29992;&#39044;&#28909;&#30340;page cache&#65292;&#25928;&#26524;&#21644;&#22312;cgroup&#22806;&#25191;&#34892; ffm -v &#30456;&#21516;</span>
<span style="color: #00ffff;">for</span> f<span style="color: #00ffff;"> in</span> $(<span style="color: #fa8072;">cat</span> /proc/$<span style="color: #eedd82;">pid</span>/root/f.txt); <span style="color: #00ffff;">do</span> cat /proc/$<span style="color: #eedd82;">pid</span>/root/$<span style="color: #eedd82;">f</span>; <span style="color: #00ffff;">done</span>

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">drop cache</span>
<span style="color: #b0c4de;">echo</span> 3 | tee /proc/sys/vm/drop_caches

</pre>
</div>
</div>
</div>

<div id="outline-container-org1c9c8f8" class="outline-2">
<h2 id="org1c9c8f8"><span class="section-number-2">4</span> cgroup内为什么没有page cache?</h2>
<div class="outline-text-2" id="text-4">
<p>
首先可以肯定page cache生成过。这里跟踪了内核函数 <code>add_page_cache_lru</code> ，调用成功了。
</p>
<pre class="example">
# argdist 命令，来自bcc
$ argdist -p $(pgrep -nf ffm) -C 'r::add_to_page_cache_lru():int:$retval' -i 5
r::add_to_page_cache_lru():int:$retval
  COUNT  EVENT
  2904   $retval = 0
</pre>

<p>
只能是，page cache生成后，被很快删除了，为此我们找到上文 <code>libtorch_cpu.so</code> 对应的 inode 1128195。跟踪它被删除的情况。
</p>

<pre class="example">
$ timeout 120 bpftrace -e '
t:filemap:mm_filemap_delete_from_page_cache /args-&gt;i_ino == 1128195/ { printf("%d %s\n", pid, comm); print(kstack); }
'

24315 kworker/u12:4

  __delete_from_page_cache
  __remove_mapping
  shrink_page_list
  shrink_inactive_list
  shrink_node_memcg
  shirink_node
  ...
  try_to_free_mem_cgroup_pages
  wmark_work_func
  process_one_work
  worker_thread
</pre>

<p>
首先page cache是被内核线程 kworker 删除的，和 <code>wmark_work_func</code> 有关，这个是公司内核团队加的一个特性，显然被误用了。
之前观察到 cgroup的 cache使用， <code>/sys/fs/cgroup/memory/memory.stat</code> 一直为0，这就对上了，刚生成的page cache就被删除了。
</p>

<p>
公司k8s团队调整相关参数后，问题得到解决。
</p>

<p>
 <small> 一些其它用到的命令 </small>
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">&#36825;&#37324;&#21487;&#29992;&#25552;&#21069;&#22266;&#23450;ffm -v&#30340;&#36827;&#31243;ID&#65292;$$</span>
bash -c <span style="color: #ffa07a;">'echo $$; sleep 30; exec ffm -v'</span>

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">trace&#65292;&#26469;&#33258;bcc&#65292;&#36319;&#36394;&#21738;&#20123;inode&#34987;&#21152;&#20837;page cache</span>
trace -e &lt;pid&gt; -T <span style="color: #ffa07a;">'t:filemap:mm_filemap_add_to_page_cache "%ld %ld", args-&gt;s_dev, args-&gt;i_ino'</span>

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">&#26681;&#25454;inode&#26597;&#25214;&#25991;&#20214;</span>
find /usr/ -inum 128301
</pre>
</div>
</div>
</div>

<div id="outline-container-org9148476" class="outline-2">
<h2 id="org9148476"><span class="section-number-2">5</span> 总结</h2>
<div class="outline-text-2" id="text-5">
<p>
ffm运行的慢的根因在于，由于page cache总是被删除，ffm运行时需要从磁盘加载代码段（并且是反复加载），ffm大部分时间在加载程序，而不是执行程序。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: zhengzhiyong</p>
<p class="date">Created: 2023-09-03 日 22:32</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
